tutorials/laminar/fvOptions/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

sourceHumidity
{
    type            scalarSemiImplicitSource;

    timeStart       2.0;
    duration        10.0;
    selectionMode   points;
    points
    (
        (5 1 0.001)
    );

    volumeMode      absolute;
    injectionRateSuSp
    {
        thermo:specificHumidity   (1e-4 0); // kg/kg
    }
}


// ************************************************************************* //
